Revit 2027 API
RebarUpdateCurvesData.IsLayoutChanged Property
 Indicates if the layout has changed since the last regeneration.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsLayoutChanged { get; }
Public ReadOnly Property IsLayoutChanged As Boolean
	Get
public:
property bool IsLayoutChanged {
	bool get ();
}
member IsLayoutChanged : bool with get
Property Value
Boolean
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace